In [4]:
import os
from dotenv import load_dotenv
import google.generativeai as genai
from langchain_google_genai import ChatGoogleGenerativeAI
from sqlalchemy import create_engine
from langchain_community.utilities import SQLDatabase
from langchain_community.agent_toolkits import create_sql_agent
from langchain_community.utilities import SQLDatabase


load_dotenv()

api_key = "AIzaSyD3zIUqrYcGBDgo0pc1oc1ULL6XK0B3Aco"
api_key




genai.configure(api_key=api_key)

model = genai.GenerativeModel("models/gemini-2.5-flash",
                             system_instruction="Отвечай строго на русском языке. Никогда не используй другие языки.")




llm = ChatGoogleGenerativeAI(
    model="models/gemini-2.5-flash",
    google_api_key=api_key,       
    temperature=0.1,
)






username = "root"        
password = "Bay34384646"  
host = "localhost"
database = "netflix"  

engine = create_engine(f"mysql+mysqlconnector://{username}:{password}@{host}/{database}")


try:
    engine.connect()
    print("MySQL подключён")
except Exception as e:
    print("Ошибка:", e)



db = SQLDatabase(engine)
db



agent = create_sql_agent(
    llm=llm,
    db=db,
    agent_type="zero-shot-react-description", 
    verbose=True
)

MySQL подключён

In [5]:
agent.invoke("Топ 5 жанров по IMDb и популярности TMDB")

> Entering new SQL Agent Executor chain...
Action: sql_db_list_tables
Action Input:countries, credits, genres, persons, title_countries, title_genres, titlesI need to find the top 5 genres based on IMDb score and TMDB popularity. I will start by examining the schema of the `genres`, `titles`, and `title_genres` tables to understand their structure and identify the relevant columns.
Action: sql_db_schema
Action Input: genres, titles, title_genres
CREATE TABLE genres (
	genre_id INTEGER NOT NULL,
	name VARCHAR(150),
	PRIMARY KEY (genre_id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from genres table:
genre_id	name
3	Action
10	Adventure
11	Animation
*/


CREATE TABLE title_genres (
	id INTEGER NOT NULL,
	title_id INTEGER,
	genre_id INTEGER,
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from title_genres table:
id	title_id	genre_id
1	41	3
2	641	6
3	131	8
*/


CREATE TABLE titles (
	id INTEGER NOT NULL,
	show_id VARCHAR(50),
	title VARCHAR(500),
	type VARCHAR(20),
	description TEXT,
	release_year INTEGER,
	date_added DATE,
	age_certification VARCHAR(20),
	runtime INTEGER,
	seasons INTEGER,
	imdb_id VARCHAR(50),
	imdb_score DECIMAL(3, 1),
	imdb_votes INTEGER,
	tmdb_popularity DECIMAL(10, 4),
	tmdb_score DECIMAL(3, 1),
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from titles table:
id	show_id	title	type	description	release_year	date_added	age_certification	runtime	seasons	imdb_id	imdb_score	imdb_votes	tmdb_popularity	tmdb_score
1	SH1	Quickly stock gas green professor.	TV Show	Yeah case determine turn person. East nothing note.
Yard side inside upon. Tell series guess process	1991	2025-05-27	R	None	7	tt6579437	2.5	123517	495.8474	3.8
2	SH2	Interest door go letter.	TV Show	Mind activity southern service skill between. Half suddenly continue know happy. Reflect consumer mo	2017	2021-09-12	PG-13	None	1	tt1697715	3.6	32761	279.0183	2.3
3	SH3	Difference customer building will.	Movie	Bar bank each kind cover almost car. Ask third certain by management look activity. Name budget thro	1981	2022-10-14	TV-MA	90	None	tt9035760	3.2	461971	424.5147	4.6
*/I need to retrieve the top 5 genres based on their average IMDb score and TMDB popularity. I will join the `genres`, `title_genres`, and `titles` tables, group the results by genre name, and then calculate the average IMDb score and TMDB popularity for each genre. Finally, I will order the results by these averages in descending order and limit to 5.

Action: sql_db_query_checker
Action Input: SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_tmdb_popularity DESC
LIMIT 5;```sql
SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_tmdb_popularity DESC
LIMIT 5;
```The query looks correct. Now I will execute it.
Action: sql_db_query
Action Input: SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_popularity DESC
LIMIT 5;Error: (mysql.connector.errors.ProgrammingError) 1054 (42S22): Unknown column 'avg_popularity' in 'order clause'
[SQL: SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_popularity DESC
LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/20/f405)I made a mistake in the `ORDER BY` clause. I used `avg_popularity` instead of `avg_tmdb_popularity`. I need to correct the column name.
Action: sql_db_query_checker
Action Input: SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_tmdb_popularity DESC
LIMIT 5;```sql
SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_tmdb_popularity DESC
LIMIT 5;
```Action: sql_db_query
Action Input: SELECT
  g.name,
  AVG(t.imdb_score) AS avg_imdb_score,
  AVG(t.tmdb_popularity) AS avg_tmdb_popularity
FROM genres AS g
JOIN title_genres AS tg
  ON g.genre_id = tg.genre_id
JOIN titles AS t
  ON tg.title_id = t.id
GROUP BY
  g.name
ORDER BY
  avg_imdb_score DESC,
  avg_tmdb_popularity DESC
LIMIT 5;[('Adventure', Decimal('6.01831'), Decimal('252.14118592')), ('Short', Decimal('5.99846'), Decimal('258.78177692')), ('Film-Noir', Decimal('5.91964'), Decimal('246.77399464')), ('Reality', Decimal('5.91458'), Decimal('284.06915208')), ('Fantasy', Decimal('5.85645'), Decimal('296.79160806'))]I now know the final answer
Final Answer: Топ 5 жанров по IMDb и популярности TMDB:
1. Adventure (Средний IMDb: 6.02, Средняя популярность TMDB: 252.14)
2. Short (Средний IMDb: 6.00, Средняя популярность TMDB: 258.78)
3. Film-Noir (Средний IMDb: 5.92, Средняя популярность TMDB: 246.77)
4. Reality (Средний IMDb: 5.91, Средняя популярность TMDB: 284.07)
5. Fantasy (Средний IMDb: 5.86, Средняя популярность TMDB: 296.79)

> Finished chain.

{'input': 'Топ 5 жанров по IMDb и популярности TMDB',
 'output': 'Топ 5 жанров по IMDb и популярности TMDB:\n1. Adventure (Средний IMDb: 6.02, Средняя популярность TMDB: 252.14)\n2. Short (Средний IMDb: 6.00, Средняя популярность TMDB: 258.78)\n3. Film-Noir (Средний IMDb: 5.92, Средняя популярность TMDB: 246.77)\n4. Reality (Средний IMDb: 5.91, Средняя популярность TMDB: 284.07)\n5. Fantasy (Средний IMDb: 5.86, Средняя популярность TMDB: 296.79)'}

In [6]:
agent.invoke("Топ 5 стран-производителей по среднему IMDb рейтингу")

> Entering new SQL Agent Executor chain...
Action: sql_db_list_tables
Action Input:countries, credits, genres, persons, title_countries, title_genres, titlesI need to find the top 5 countries by average IMDb rating. I will start by listing the tables to identify relevant ones. Then I will examine the schema of the relevant tables to understand their structure and columns.
Action: sql_db_list_tables
Action Input:countries, credits, genres, persons, title_countries, title_genres, titlesI need to find the top 5 countries by average IMDb rating. I will start by listing the tables to identify relevant ones. Then I will examine the schema of the relevant tables to understand their structure and columns.
Action: sql_db_schema
Action Input: titles, title_countries, countries
CREATE TABLE countries (
	country_id INTEGER NOT NULL,
	name VARCHAR(150),
	PRIMARY KEY (country_id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from countries table:
country_id	name
27	Afghanistan
44	Algeria
40	Angola
*/


CREATE TABLE title_countries (
	id INTEGER NOT NULL,
	title_id INTEGER,
	country_id INTEGER,
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from title_countries table:
id	title_id	country_id
1	925	103
2	1220	19
3	873	107
*/


CREATE TABLE titles (
	id INTEGER NOT NULL,
	show_id VARCHAR(50),
	title VARCHAR(500),
	type VARCHAR(20),
	description TEXT,
	release_year INTEGER,
	date_added DATE,
	age_certification VARCHAR(20),
	runtime INTEGER,
	seasons INTEGER,
	imdb_id VARCHAR(50),
	imdb_score DECIMAL(3, 1),
	imdb_votes INTEGER,
	tmdb_popularity DECIMAL(10, 4),
	tmdb_score DECIMAL(3, 1),
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from titles table:
id	show_id	title	type	description	release_year	date_added	age_certification	runtime	seasons	imdb_id	imdb_score	imdb_votes	tmdb_popularity	tmdb_score
1	SH1	Quickly stock gas green professor.	TV Show	Yeah case determine turn person. East nothing note.
Yard side inside upon. Tell series guess process	1991	2025-05-27	R	None	7	tt6579437	2.5	123517	495.8474	3.8
2	SH2	Interest door go letter.	TV Show	Mind activity southern service skill between. Half suddenly continue know happy. Reflect consumer mo	2017	2021-09-12	PG-13	None	1	tt1697715	3.6	32761	279.0183	2.3
3	SH3	Difference customer building will.	Movie	Bar bank each kind cover almost car. Ask third certain by management look activity. Name budget thro	1981	2022-10-14	TV-MA	90	None	tt9035760	3.2	461971	424.5147	4.6
*/I have the schema for `countries`, `title_countries`, and `titles`. I need to join these tables to get the country name and the IMDb score. Then I will group by country name and calculate the average IMDb score, ordering by the average score in descending order and limiting to 5.
Action: sql_db_query_checker
Action Input: SELECT T2.name, AVG(T1.imdb_score) AS avg_imdb_score FROM titles AS T1 JOIN title_countries AS T3 ON T1.id = T3.title_id JOIN countries AS T2 ON T3.country_id = T2.country_id WHERE T1.imdb_score IS NOT NULL GROUP BY T2.name ORDER BY avg_imdb_score DESC LIMIT 5```sql
SELECT T2.name, AVG(T1.imdb_score) AS avg_imdb_score FROM titles AS T1 JOIN title_countries AS T3 ON T1.id = T3.title_id JOIN countries AS T2 ON T3.country_id = T2.country_id WHERE T1.imdb_score IS NOT NULL GROUP BY T2.name ORDER BY avg_imdb_score DESC LIMIT 5
```Action: sql_db_query
Action Input: SELECT T2.name, AVG(T1.imdb_score) AS avg_imdb_score FROM titles AS T1 JOIN title_countries AS T3 ON T1.id = T3.title_id JOIN countries AS T2 ON T3.country_id = T2.country_id WHERE T1.imdb_score IS NOT NULL GROUP BY T2.name ORDER BY avg_imdb_score DESC LIMIT 5[('Malawi', Decimal('7.50000')), ('Grenada', Decimal('7.33636')), ('Slovakia (Slovak Republic)', Decimal('7.32000')), ('Macao', Decimal('7.11000')), ('Uzbekistan', Decimal('7.06364'))]I now know the final answer
Final Answer: Топ 5 стран-производителей по среднему IMDb рейтингу:
1. Malawi: 7.50
2. Grenada: 7.34
3. Slovakia (Slovak Republic): 7.32
4. Macao: 7.11
5. Uzbekistan: 7.06

> Finished chain.

{'input': 'Топ 5 стран-производителей по среднему IMDb рейтингу',
 'output': 'Топ 5 стран-производителей по среднему IMDb рейтингу:\n1. Malawi: 7.50\n2. Grenada: 7.34\n3. Slovakia (Slovak Republic): 7.32\n4. Macao: 7.11\n5. Uzbekistan: 7.06'}

In [7]:
agent.invoke("Топ 5 возрастных рейтингов по среднему IMDb")

> Entering new SQL Agent Executor chain...
Action: sql_db_list_tables
Action Input:countries, credits, genres, persons, title_countries, title_genres, titlesAction: sql_db_schema
Action Input: titles
CREATE TABLE titles (
	id INTEGER NOT NULL,
	show_id VARCHAR(50),
	title VARCHAR(500),
	type VARCHAR(20),
	description TEXT,
	release_year INTEGER,
	date_added DATE,
	age_certification VARCHAR(20),
	runtime INTEGER,
	seasons INTEGER,
	imdb_id VARCHAR(50),
	imdb_score DECIMAL(3, 1),
	imdb_votes INTEGER,
	tmdb_popularity DECIMAL(10, 4),
	tmdb_score DECIMAL(3, 1),
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from titles table:
id	show_id	title	type	description	release_year	date_added	age_certification	runtime	seasons	imdb_id	imdb_score	imdb_votes	tmdb_popularity	tmdb_score
1	SH1	Quickly stock gas green professor.	TV Show	Yeah case determine turn person. East nothing note.
Yard side inside upon. Tell series guess process	1991	2025-05-27	R	None	7	tt6579437	2.5	123517	495.8474	3.8
2	SH2	Interest door go letter.	TV Show	Mind activity southern service skill between. Half suddenly continue know happy. Reflect consumer mo	2017	2021-09-12	PG-13	None	1	tt1697715	3.6	32761	279.0183	2.3
3	SH3	Difference customer building will.	Movie	Bar bank each kind cover almost car. Ask third certain by management look activity. Name budget thro	1981	2022-10-14	TV-MA	90	None	tt9035760	3.2	461971	424.5147	4.6
*/Action: sql_db_query_checker
Action Input: SELECT age_certification, AVG(imdb_score) AS avg_imdb_score FROM titles WHERE age_certification IS NOT NULL GROUP BY age_certification ORDER BY avg_imdb_score DESC LIMIT 5```sql
SELECT age_certification, AVG(imdb_score) AS avg_imdb_score FROM titles WHERE age_certification IS NOT NULL GROUP BY age_certification ORDER BY avg_imdb_score DESC LIMIT 5
```The query looks correct. It selects the `age_certification` and the average `imdb_score`, filters out null `age_certification` values, groups by `age_certification`, orders by the average `imdb_score` in descending order, and limits the results to 5.
Action: sql_db_query
Action Input: SELECT age_certification, AVG(imdb_score) AS avg_imdb_score FROM titles WHERE age_certification IS NOT NULL GROUP BY age_certification ORDER BY avg_imdb_score DESC LIMIT 5[('TV-MA', Decimal('5.73836')), ('None', Decimal('5.69949')), ('TV-G', Decimal('5.66347')), ('PG-13', Decimal('5.60720')), ('PG', Decimal('5.60700'))]Final Answer: The top 5 age certifications by average IMDb score are:
*   TV-MA: 5.73836
*   None: 5.69949
*   TV-G: 5.66347
*   PG-13: 5.60720
*   PG: 5.60700

> Finished chain.

{'input': 'Топ 5 возрастных рейтингов по среднему IMDb',
 'output': 'The top 5 age certifications by average IMDb score are:\n*   TV-MA: 5.73836\n*   None: 5.69949\n*   TV-G: 5.66347\n*   PG-13: 5.60720\n*   PG: 5.60700'}

In [8]:
agent.invoke("Какие жанры имеют высокий IMDb, но мало тайтлов?")

> Entering new SQL Agent Executor chain...
Action: sql_db_list_tables
Action Input:countries, credits, genres, persons, title_countries, title_genres, titlesI need to find genres with high IMDb scores but few titles.
I will need to join `genres`, `title_genres`, and `titles` tables.
First, I need to check the schema of these tables to understand their columns.
Action: sql_db_schema
Action Input: genres, title_genres, titles
CREATE TABLE genres (
	genre_id INTEGER NOT NULL,
	name VARCHAR(150),
	PRIMARY KEY (genre_id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from genres table:
genre_id	name
3	Action
10	Adventure
11	Animation
*/


CREATE TABLE title_genres (
	id INTEGER NOT NULL,
	title_id INTEGER,
	genre_id INTEGER,
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from title_genres table:
id	title_id	genre_id
1	41	3
2	641	6
3	131	8
*/


CREATE TABLE titles (
	id INTEGER NOT NULL,
	show_id VARCHAR(50),
	title VARCHAR(500),
	type VARCHAR(20),
	description TEXT,
	release_year INTEGER,
	date_added DATE,
	age_certification VARCHAR(20),
	runtime INTEGER,
	seasons INTEGER,
	imdb_id VARCHAR(50),
	imdb_score DECIMAL(3, 1),
	imdb_votes INTEGER,
	tmdb_popularity DECIMAL(10, 4),
	tmdb_score DECIMAL(3, 1),
	PRIMARY KEY (id)
)COLLATE utf8mb4_0900_ai_ci ENGINE=InnoDB DEFAULT CHARSET=utf8mb4

/*
3 rows from titles table:
id	show_id	title	type	description	release_year	date_added	age_certification	runtime	seasons	imdb_id	imdb_score	imdb_votes	tmdb_popularity	tmdb_score
1	SH1	Quickly stock gas green professor.	TV Show	Yeah case determine turn person. East nothing note.
Yard side inside upon. Tell series guess process	1991	2025-05-27	R	None	7	tt6579437	2.5	123517	495.8474	3.8
2	SH2	Interest door go letter.	TV Show	Mind activity southern service skill between. Half suddenly continue know happy. Reflect consumer mo	2017	2021-09-12	PG-13	None	1	tt1697715	3.6	32761	279.0183	2.3
3	SH3	Difference customer building will.	Movie	Bar bank each kind cover almost car. Ask third certain by management look activity. Name budget thro	1981	2022-10-14	TV-MA	90	None	tt9035760	3.2	461971	424.5147	4.6
*/Action: sql_db_query_checker
Action Input: SELECT g.name AS genre_name, AVG(t.imdb_score) AS avg_imdb_score, COUNT(t.id) AS num_titles FROM genres AS g JOIN title_genres AS tg ON g.genre_id = tg.genre_id JOIN titles AS t ON tg.title_id = t.id WHERE t.imdb_score IS NOT NULL GROUP BY g.name HAVING COUNT(t.id) < 100 ORDER BY avg_imdb_score DESC, num_titles ASC LIMIT 10;SELECT g.name AS genre_name, AVG(t.imdb_score) AS avg_imdb_score, COUNT(t.id) AS num_titles FROM genres AS g JOIN title_genres AS tg ON g.genre_id = tg.genre_id JOIN titles AS t ON tg.title_id = t.id WHERE t.imdb_score IS NOT NULL GROUP BY g.name HAVING COUNT(t.id) < 100 ORDER BY avg_imdb_score DESC, num_titles ASC LIMIT 10;Thought: The query looks good. I will execute it.
Action: sql_db_query
Action Input: SELECT g.name AS genre_name, AVG(t.imdb_score) AS avg_imdb_score, COUNT(t.id) AS num_titles FROM genres AS g JOIN title_genres AS tg ON g.genre_id = tg.genre_id JOIN titles AS t ON tg.title_id = t.id WHERE t.imdb_score IS NOT NULL GROUP BY g.name HAVING COUNT(t.id) < 100 ORDER BY avg_imdb_score DESC, num_titles ASC LIMIT 10;[('Adventure', Decimal('6.01831'), 71), ('Short', Decimal('5.99846'), 65), ('Film-Noir', Decimal('5.91964'), 56), ('Reality', Decimal('5.91458'), 48), ('Fantasy', Decimal('5.85645'), 62), ('Crime', Decimal('5.85323'), 62), ('Drama', Decimal('5.81846'), 65), ('Biography', Decimal('5.79107'), 56), ('Romance', Decimal('5.77432'), 74), ('Sci-Fi', Decimal('5.76667'), 57)]I now know the final answer
Final Answer: Жанры с высоким IMDb, но малым количеством тайтлов (менее 100) включают: Adventure (средний IMDb: 6.02, 71 тайтл), Short (средний IMDb: 6.00, 65 тайтлов), Film-Noir (средний IMDb: 5.92, 56 тайтлов), Reality (средний IMDb: 5.91, 48 тайтлов), Fantasy (средний IMDb: 5.86, 62 тайтла), Crime (средний IMDb: 5.85, 62 тайтла), Drama (средний IMDb: 5.82, 65 тайтлов), Biography (средний IMDb: 5.79, 56 тайтлов), Romance (средний IMDb: 5.77, 74 тайтла), Sci-Fi (средний IMDb: 5.77, 57 тайтлов).

> Finished chain.

{'input': 'Какие жанры имеют высокий IMDb, но мало тайтлов?',
 'output': 'Жанры с высоким IMDb, но малым количеством тайтлов (менее 100) включают: Adventure (средний IMDb: 6.02, 71 тайтл), Short (средний IMDb: 6.00, 65 тайтлов), Film-Noir (средний IMDb: 5.92, 56 тайтлов), Reality (средний IMDb: 5.91, 48 тайтлов), Fantasy (средний IMDb: 5.86, 62 тайтла), Crime (средний IMDb: 5.85, 62 тайтла), Drama (средний IMDb: 5.82, 65 тайтлов), Biography (средний IMDb: 5.79, 56 тайтлов), Romance (средний IMDb: 5.77, 74 тайтла), Sci-Fi (средний IMDb: 5.77, 57 тайтлов).'}